#Область ПрограммныйИнтерфейс
	//Добавляет в формы всех документов новое поле "Контактное лицо"
Процедура ДополнитьФорму(Форма) Экспорт
	//++Пахомов ДЗ 13.7 17.02.2026
	//Добавление в формы документов поля Контактное лицо
	//В Форму документа Заказ покупателя поле и кнопку для согласованной скидки и пересчета таблиц
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидка(Форма);
		ДобавитьКомандуПересчитатьТаблицу(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;	
	//--Пахомов ДЗ 13.7 17.02.2026	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
	
	Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
		//++Пахомов ДЗ 11.2 21.12.2025 20:43:45
		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ДЗ_11_2_КонтактноеЛицо";
		//--Пахомов ДЗ 11.2 21.12.2025 20:44:00
	КонецПроцедуры
	
	Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
		//++Пахомов ДЗ 11.2 21.12.2025 20:44:24
		ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ДЗ_11_2_КонтактноеЛицо";
		//--Пахомов ДЗ 11.2 21.12.2025 20:44:32
	КонецПроцедуры
	
	Процедура ДобавитьПолеСогласованнаяСкидка(Форма)
		//++Пахомов ДЗ 11.2 21.12.2025 20:45:46
		ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ДЗ_11_2_СогласованнаяСкидка";
		ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
		//--Пахомов ДЗ 11.2 21.12.2025 20:45:55
	КонецПроцедуры
	
	Процедура ДобавитьКомандуПересчитатьТаблицу(Форма)
		//++Пахомов ДЗ 11.2 21.12.2025 20:46:16
		Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
		Команда.Заголовок = "Пересчитать таблицу";
		Команда.Действие = "КомандаПересчитатьТаблицу";
		
		КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"),Форма.Элементы.ГруппаШапкаЛево);
		КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
		КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		//--Пахомов ДЗ 11.2 21.12.2025 0:04:13
	КонецПроцедуры	
	
#КонецОбласти